---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailable
source: html/d9089382-a0fb-ba6d-0526-69bcf5361f54.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotEnoughSlotsOnlyLugAvailable Property

There aren't enough slots on panel [Panel Name], so the circuit will connect through Feed Through Lugs.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotEnoughSlotsOnlyLugAvailable { get; }
```